
/*======================================================================
  Структура Stack
*/
typedef struct Stack
{
	int value;
	struct Stack* next;
} Stack;
//======================================================================



/*======================================================================
  Функция push добавляет в стек значение value, переданное 
  в качестве аргумента
*/
void push(Stack** head, int value);
//======================================================================



/*======================================================================
  Функция pop удаляет последний добавленный элемент стека
*/
void pop(struct Stack **head);
//======================================================================



/*======================================================================
  Функция top возвращает последний добавленный элемент стека
*/
int top(struct Stack *head);
//======================================================================



/*======================================================================
  Функция empty проверяет стек на пустоту. 
  1 - если стек пустой
  0 - если в стеке присутствует хотя бы один элемент
*/
int empty(struct Stack *head);
//======================================================================
